Repository: asaddin02/raho_mobile
Catalog: lib/l10n/app_*.arb
Languages: id, zh

# therapy_detail_success
source: Therapy details retrieved successfully
id: Detail terapi berhasil diambil
zh: 治疗详情获取成功

# therapy_detail_failed
source: Failed to retrieve therapy details
id: Gagal mengambil detail terapi
zh: 获取治疗详情失败

# lab_id_required
source: Laboratory ID is required
id: ID laboratorium harus diisi
zh: 化验ID为必填项

# lab_record_not_found
source: Laboratory data not found
id: Data laboratorium tidak ditemukan
zh: 未找到化验数据

# lab_detail_fetched
source: Laboratory details retrieved successfully
id: Detail laboratorium berhasil diambil
zh: 化验详情获取成功

# labDetailTitle
source: Lab Result Detail
id: Detail Hasil Lab

source: Lab Number
id: Nomor Lab

# labPatient
source: Patient
id: Pasien

# labDoctor
source: Doctor
id: Dokter

# labDate
source: Date
id: Tanggal

source: Lab Officer
id: Petugas Lab

# labDiagnosis
source: Initial Diagnosis
id: Diagnosa Awal

# labTestResults
source: Test Results
id: Hasil Tes

# searchLabResults
source: Search test results...
id: Cari hasil tes...

source: No Lab Results
id: Tidak Ada Hasil Lab

# noLabResultsDesc
source: No test results available
id: Tidak ada hasil tes tersedia

# noSearchResults
source: No results found
id: Hasil tidak ditemukan

# noSearchResultsFor
source: for "{search_query}"
id: untuk "{search_query}"

source: Other Tests
id: Tes Lainnya

# testsCount
source: {count} tests
id: {count} tes

# labResult
source: Result
id: Hasil

# labNormalRange
source: Normal Range
id: Rentang Normal

# companyClubName
source: RAHO Club
zh: RAHO 俱乐部

# companyTagline
source: Reverse Aging & Homeostasis Club
zh: 逆龄与稳态俱乐部

# transactionDetailFreeVoucher
source: Free Voucher
zh: 免费优惠券

# therapyInfoMember
source: Member
zh: 会员

# therapyStartSurvey
source: Start Survey
zh: 开始调查

# therapyHealingCrisisTitle
source: Healing Crisis
zh: 康复危机

# therapyNeedleUsageHeaderStatus
source: Status
zh: 状态

# therapySectionAnamnesis
source: Anamnesis
zh: 病史询问

# therapyTabLab
source: Lab
zh: 化验

# filterTitle
source: Filter
zh: 筛选

# transactionDetailAdmin
source: Admin
zh: 管理员

# personalDataEditButton
source: Edit
zh: 编辑

# referenceErrorMessage
source: Error: {message}
zh: 错误：{message}

# labTestTitle
source: Lab Test
zh: 化验检查

# labResultLabel
source: Lab Result
zh: 化验结果

# transactionErrorMessage
source: Error: {message}
zh: 错误：{message}
