Repository: asaddin02/raho_mobile
Catalog: lib/l10n/app_*.arb
Languages: id, zh

# appVersion
source: version 1.0.0
id: versi 1.0.0
zh: 版本 1.0.0

source: Supported By:
id: Didukung Oleh:
zh: 支持方：

source: Success
id: Berhasil
zh: 成功

source: Error
id: Kesalahan
zh: 错误

source: Warning
id: Peringatan
zh: 警告

# info
source: Information
id: Informasi
zh: 信息

# onboardingTitle1
source: Nanobubble Technology
id: Teknologi NanoBubble
zh: 纳米气泡技术

# onboardingSubtitle1
source: RAHO Club provides research-based healthcare services using Nanobubble Technology, supported by research from Indonesiaâ€™s Institute of Molecular Research.
id: Pelayanan kesehatan pertama di Dunia yang menggunakan Teknologi Nanobubble sebagai alat kesehatan
zh: 全球首个使用纳米气泡技术作为医疗设备的保健服务

# onboardingTitle2
source: Professional Medical Team
id: Ahli Kesehatan
zh: 健康专家

# onboardingSubtitle2
source: Our professional medical team helps RAHO Club members achieve a better quality of life in their later years.
id: Dibantu dengan Dokter yang Profesional di bidang kesehatan
zh: 由健康领域专业医生支持

# onboardingTitle3
source: Branches Across Indonesia
id: Pelayanan Member
zh: 会员服务

# onboardingSubtitle3
source: RAHO Club currently has 11 branches across Indonesia and will continue to grow as medical research and technology advance.
id: Dilayani oleh para tenaga medis yang berkualitas dan mengutamakan kesejahteraan Anda
zh: 由优质医疗团队为您服务，优先考虑您的福祉

# buttonSkipOnboarding
source: Skip
id: Lewati
zh: 跳过

# buttonCompleteOnboarding
source: Complete
id: Selesai
zh: 完成

# buttonNextOnboarding
source: Next
id: Selanjutnya
zh: 下一步

# buttonPreviousOnboarding
source: Previous
id: Sebelumnya
zh: 上一步

# forgotPasswordButton
source: Forgot Password?
id: Lupa Password?
zh: 忘记密码？

# passwordEmptyError
source: Password cannot be empty
id: Password tidak boleh kosong
zh: 密码不能为空

# passwordMinLengthError
source: Password must be at least 8 characters
id: Password minimal 8 karakter
zh: 密码至少8个字符

# confirmPasswordLabel
source: Confirm Password
id: Konfirmasi Password
zh: 确认密码

# confirmPasswordHintText
source: Re-enter password
id: Masukkan ulang password
zh: 重新输入密码

# confirmPasswordEmptyError
source: Confirm password cannot be empty
id: Konfirmasi password tidak boleh kosong
zh: 确认密码不能为空

# passwordMismatchError
source: Passwords do not match
id: Password tidak sama
zh: 密码不匹配

# processingText
source: Processing...
id: Memproses...
zh: 处理中...

# verificationTitle
source: Member Verification
id: Verifikasi Member
zh: 会员验证

# verificationSubtitle
source: Enter your member registration ID for verification
id: Masukkan ID Registrasi member Anda untuk melakukan verifikasi
zh: 输入您的会员注册ID进行验证

# idRegisterHintText
source: Enter Registration ID
id: Masukkan ID Registrasi
zh: 输入注册ID

# idRegisterLabel
source: Registration ID
id: ID Registrasi
zh: 注册ID

# verificationButton
source: Send Code
id: Kirim Kode
zh: 发送验证码

# otpTitle
source: OTP Code
id: Kode OTP
zh: 验证码

# otpSubtitle
source: Enter the OTP code sent to {number_phone}
id: Masukkan kode OTP yang terkirim ke nomor {number_phone}
zh: 输入发送到 {number_phone} 的验证码

# otpNotReceive
source: Didn't receive code?
id: Tidak menerima kode?
zh: 没收到验证码？

# otpResend
source: Resend
id: Kirim ulang
zh: 重新发送

# otpButton
source: Verify
id: Verifikasi
zh: 验证

# verifiedNumberTitle
source: Verification Successful
id: Verifikasi Berhasil
zh: 验证成功

# verifiedNumberSubtitle
source: Congratulations! You are now verified as a member in our system
id: Selamat Anda sudah terverifikasi sebagai member di sistem kami
zh: 恭喜！您已在我们的系统中成功验证为会员

source: Create Password
id: Buat Sandi
zh: 创建密码

# createPasswordSupportText
source: Create your password for authentication
id: Buat kata sandi Anda untuk mendapatkan autentikasi
zh: 创建您的认证密码

# createPasswordHintText
source: New password
id: Kata sandi baru
zh: 新密码

# passwordButton
source: Create & Login
id: Buat dan Masuk
zh: 创建并登录

# loginTitle
source: Welcome
id: Selamat Datang
zh: 欢迎

# loginSubtitle
source: Please login to your account
id: Silahkan masuk ke akun Anda
zh: 请登录您的账户

# passwordLabel
source: Password
id: Kata Sandi
zh: 密码

# passwordHintText
source: Enter Password
id: Masukkan Kata Sandi
zh: 输入密码

# loginButton
source: Login
id: Masuk
zh: 登录

# loginErrorRequiredField
source: Registration ID and Password are required
id: ID Registrasi dan Kata Sandi wajib diisi
zh: 注册ID和密码为必填项

# loginAuthenticationFailed
source: Invalid Registration ID or Password
id: ID Registrasi dan Kata Sandi salah
zh: 注册ID或密码无效

# loginSuccess
source: Login Successful
id: Login Berhasil
zh: 登录成功

# dashboardBottomNavText
source: Home
id: Beranda
zh: 首页

# therapyBottomNavText
source: Therapy
id: Terapi
zh: 治疗

# transactionBottomNavText
source: Transaction
id: Transaksi
zh: 交易

# profileBottomNavText
source: Profile
id: Profil
zh: 个人资料

# profilePageTitle
source: My Profile
id: Profil Saya
zh: 我的资料

# themeDarkLabel
source: Dark
id: Gelap
zh: 深色

# themeLightLabel
source: Light
id: Terang
zh: 浅色

# personalSectionTitle
source: Personal
id: Pribadi
zh: 个人

# supportSectionTitle
source: Support
id: Dukungan
zh: 支持

# settingsSectionTitle
source: Settings
id: Pengaturan
zh: 设置

# personalDataMenuTitle
source: Personal Data
id: Data Pribadi
zh: 个人资料

# personalDataMenuSubtitle
source: Manage your personal information
id: Kelola informasi pribadi Anda
zh: 管理您的个人信息

# diagnosisMenuTitle
source: My Diagnosis
id: Diagnosa Saya
zh: 我的诊断

# diagnosisMenuSubtitle
source: Medical diagnosis history
id: Riwayat diagnosa medis
zh: 医疗诊断历史

# referenceCodeMenuTitle
source: Reference Code
id: Referensi Code
zh: 参考代码

# referenceCodeMenuSubtitle
source: Service reference code
id: Kode referensi layanan
zh: 服务参考代码

# branchLocationMenuTitle
source: Branch Locations
id: Lokasi Cabang
zh: 分店位置

# branchLocationMenuSubtitle
source: Find nearest branch
id: Cari cabang terdekat
zh: 查找最近分店

# helpMenuTitle
source: Help
id: Bantuan
zh: 帮助

# helpMenuSubtitle
source: Help center and support
id: Pusat bantuan dan dukungan
zh: 帮助中心与支持

# languageMenuTitle
source: Language
id: Bahasa
zh: 语言

# languageMenuSubtitle
source: Change app language
id: Ubah bahasa aplikasi
zh: 更改应用语言

# aboutAppMenuTitle
source: About App
id: Tentang Aplikasi
zh: 关于应用

# aboutAppMenuSubtitle
source: Detailed app information
id: Informasi detail aplikasi
zh: 详细应用信息

# logoutButtonLabel
source: Logout
id: Keluar
zh: 登出

# personalInfoSectionTitle
source: Personal Information
id: Informasi Pribadi
zh: 个人信息

# fieldLabelNIK
source: National ID
id: NIK
zh: 身份证号

# fieldLabelAddress
source: Address
id: Alamat
zh: 地址

# fieldLabelCity
source: City/District
id: Kota/Kabupaten
zh: 城市/地区

# fieldLabelDateOfBirth
source: Date of Birth
id: Tanggal Lahir
zh: 出生日期

# fieldLabelAge
source: Age
id: Usia
zh: 年龄

# fieldSuffixYears
source: Years
id: Tahun
zh: 岁

# fieldLabelGender
source: Gender
id: Jenis Kelamin
zh: 性别

# fieldLabelPhone
source: WhatsApp Number
id: Nomor WhatsApp
zh: WhatsApp号码

# referenceInfoTitle
source: Reference Information
id: Informasi Referensi
zh: 参考信息

# cardNumberFieldLabel
source: Card Number
id: Nomor Kartu
zh: 卡号

# referralNameFieldLabel
source: Referral Name
id: Nama Referal
zh: 推荐人姓名

# diagnosisNoteTitle
source: Additional Notes
id: Catatan Tambahan
zh: 附加说明

# diagnosisCurrentIllnessTitle
source: Current Complaints and Medical History
id: Keluhan dan Riwayat Penyakit
zh: 当前症状和病史

# diagnosisPreviousIllnessTitle
source: Previous and Family Medical History
id: Riwayat Penyakit Terdahulu dan Keluarga
zh: 既往病史和家族史

# diagnosisSocialHabitTitle
source: Social and Lifestyle History
id: Riwayat Sosial dan Kebiasaan
zh: 社会和生活习惯史

# diagnosisTreatmentHistoryTitle
source: Treatment History
id: Riwayat Pengobatan
zh: 治疗史

# diagnosisPhysicalExamTitle
source: Physical Examination
id: Pemeriksaan Fisik
zh: 体格检查

# aboutDialogTitle
source: About App
id: Tentang Aplikasi
zh: 关于应用

# aboutVersionLabel
source: Version
id: Versi
zh: 版本

# aboutCopyrightLabel
source: Copyright
id: Hak Cipta
zh: 版权

# aboutReleaseDateLabel
source: Release Date
id: Tanggal Rilis
zh: 发布日期

# aboutCloseButton
source: Close
id: Tutup
zh: 关闭

# languageDialogTitle
source: Select Language
id: Pilih Bahasa
zh: 选择语言

# languageOptionIndonesian
source: Indonesian
id: Bahasa Indonesia
zh: 印尼语

# languageOptionEnglish
source: English
id: Bahasa Inggris
zh: 英语

# languageOptionChinese
source: Chinese
id: Bahasa Mandarin
zh: 中文

# languageCancelButton
source: Cancel
id: Batal
zh: 取消

# languageSaveButton
source: Save
id: Simpan
zh: 保存

# logoutDialogTitle
source: Confirm Logout
id: Konfirmasi Keluar
zh: 确认登出

# logoutDialogMessage
source: Are you sure you want to logout?
id: Apakah Anda yakin ingin keluar dari aplikasi?
zh: 您确定要登出吗？

# logoutCancelButton
source: Cancel
id: Batal
zh: 取消

# logoutConfirmButton
source: Logout
id: Keluar
zh: 登出

# dashboardWelcome
source: Welcome
id: Selamat Datang
zh: 欢迎

# dashboardYourVoucher
source: Your Vouchers
id: Voucher Anda
zh: 您的优惠券

# dashboardUsedVoucher
source: Used Vouchers
id: Voucher Terpakai
zh: 已使用优惠券

# dashboardLastTherapy
source: Last Therapy
id: Terapi Terakhir
zh: 最近治疗

# dashboardEventPromo
source: Events and Promos
id: Event dan Promo
zh: 活动与促销

# dashboardTherapyInfusionNumber
source: Infusion #{infusion_number}
id: Infus ke-{infusion_number}
zh: 第{infusion_number}次输液

# myVoucherTitle
source: My Vouchers
id: Voucher Saya
zh: 我的优惠券

# voucherFilterDate
source: Select Date
id: Pilih Tanggal
zh: 选择日期

# voucherDateAll
source: All Dates
id: Semua Tanggal
zh: 所有日期

# voucherDateToday
source: Today
id: Hari Ini
zh: 今天

# voucherDate7Days
source: Last 7 Days
id: 7 Hari Terakhir
zh: 最近7天

# voucherDate30Days
source: Last 30 Days
id: 30 Hari Terakhir
zh: 最近30天

# voucherDate60Days
source: Last 60 Days
id: 60 Hari Terakhir
zh: 最近60天

# voucherDate90Days
source: Last 90 Days
id: 90 Hari Terakhir
zh: 最近90天

# voucherRedeemDate
source: Redeemed on {redeem_date}
id: Ditukar pada {redeem_date}
zh: 兑换于 {redeem_date}

# voucherRedeemDateLabel
source: Redeem Date: {redeem_date}
id: Tanggal Redeem: {redeem_date}
zh: 兑换日期：{redeem_date}

# transactionDetailTitle
source: Transaction Details
id: Rincian Transaksi
zh: 交易详情

# transactionStatusPaid
source: Paid
id: Terbayar
zh: 已支付

# transactionTherapyDone
source: Therapy service completed
id: Layanan terapi sudah dilakukan
zh: 治疗服务已完成

# transactionAmount
source: ${amount}
id: Rp {amount}

# transactionDetailMemberName
source: Member Name
id: Nama Member
zh: 会员姓名

# transactionDetailInvoiceNumber
source: Invoice Number
id: Nomor Invoice
zh: 发票号

# transactionDetailBranchClinic
source: Branch Clinic
id: Klinik Cabang
zh: 分店诊所

# transactionDetailDate
source: Date
id: Tanggal
zh: 日期

# transactionDetailTherapyType
source: Therapy Type
id: Jenis Terapi
zh: 治疗类型

# transactionDetailPaymentMethod
source: Payment Method
id: Metode Pembayaran
zh: 支付方式

# transactionDetailVoucherQty
source: Voucher Quantity
id: Jumlah Voucher
zh: 优惠券数量

# transactionDetailUnitPrice
source: Unit Price
id: Harga Satuan
zh: 单价

# transactionDetailTotalAmount
source: Total Amount
id: Total Transaksi
zh: 总金额

# transactionActionDownload
source: Download
id: Unduh
zh: 下载

# transactionActionShare
source: Share
id: Bagikan
zh: 分享

# transactionActionSeeRedeemVoucher
source: View Redeemed Voucher
id: Lihat Redeem Voucher
zh: 查看已兑换优惠券

# therapyDetailTitle
source: Therapy Details
id: Rincian Terapi
zh: 治疗详情

# therapyInfoDate
source: Date
id: Tanggal
zh: 日期

# therapyTabHistory
source: Therapy History
id: Riwayat Terapi
zh: 治疗历史

# therapyTabSurvey
source: Survey History
id: Riwayat Survey
zh: 调查历史

# therapySurveyEmpty
source: No survey data available
id: Belum ada data survey tersedia
zh: 暂无调查数据

# therapyInfoCardTitle
source: Therapy Information
id: Informasi Terapi
zh: 治疗信息

# therapyInfusNumber
source: Infusion No.
id: Infus ke
zh: 输液次数

# therapyInfusType
source: Infusion Type
id: Jenis Infus
zh: 输液类型

# therapyProductionDate
source: Production Date
id: Tgl. Produksi
zh: 生产日期

# therapyNextInfusDate
source: Next Infusion
id: Infus berikutnya
zh: 下次输液

# therapyHealingCrisisComplaint
source: Healing Crisis Complaint
id: Keluhan Healing Crisis
zh: 康复危机症状

# therapyHealingCrisisNote
source: Notes/Action
id: Catatan/Tindakan
zh: 备注/措施

# therapyNeedleUsageTitle
source: Needle Usage
id: Penggunaan Jarum
zh: 针具使用

# therapyNeedleUsageHeaderNeedle
source: Needle
id: Jarum
zh: 针具

# therapyNeedleUsageHeaderNakes
source: Staff
id: Nakes
zh: 医护人员

# therapyNeedleUsed
source: Used
id: Digunakan
zh: 已使用

# therapySectionLabPhoto
source: Lab Photos
id: Foto Lab
zh: 化验照片

# therapyLabPhotoEmpty
source: No lab photos available
id: Belum ada foto lab tersedia
zh: 暂无化验照片

# therapyComplaintAfter
source: Complaints After Therapy
id: Keluhan Setelah Terapi
zh: 治疗后症状

# therapyComplaintBefore
source: Complaints Before Therapy
id: Keluhan Sebelum Terapi
zh: 治疗前症状

# therapyNoComplaint
source: No Complaints
id: Tidak Ada Keluhan
zh: 无症状

# therapyVitalSignBloodPressure
source: Blood Pressure
id: Tekanan Darah
zh: 血压

# therapyVitalSignSystolic
source: Systolic
id: Sistolik
zh: 收缩压

# therapyVitalSignDiastolic
source: Diastolic
id: Diastolik
zh: 舒张压

# therapyVitalSignO2AndHR
source: O2 Saturation & Heart Rate
id: Saturasi O2 & Heart Rate
zh: 血氧饱和度与心率

# therapyVitalSaturationBefore
source: Saturation Before
id: Saturasi Sebelum
zh: 治疗前饱和度

# therapyVitalSaturationAfter
source: Saturation After
id: Saturasi Sesudah
zh: 治疗后饱和度

# therapyVitalPerfusionBefore
source: Perfusion Index Before
id: Index Perfusi Sebelum
zh: 治疗前灌注指数

# therapyVitalPerfusionAfter
source: Perfusion Index After
id: Index Perfusi Sesudah
zh: 治疗后灌注指数

# therapyVitalHRBefore
source: HR Before
id: HR Sebelum
zh: 治疗前心率

# therapyVitalHRAfter
source: HR After
id: HR Sesudah
zh: 治疗后心率

# historyPageTitle
source: My History
id: Riwayat Saya
zh: 我的历史

# therapyTabTherapy
source: Therapy
id: Terapi
zh: 治疗

# therapySearchHint
source: Search therapy history...
id: Cari riwayat terapi...
zh: 搜索治疗历史...

# labSearchHint
source: Search laboratory history...
id: Cari riwayat laboratorium...
zh: 搜索化验历史...

# therapyCardInfusionNumber
source: Infusion #{infusionNumber}
id: Infus ke-{infusionNumber}
zh: 第{infusionNumber}次输液

# therapyEmptyTitle
source: No therapy history
id: Belum ada riwayat terapi
zh: 暂无治疗历史

# therapyEmptySubtitle
source: Your therapy history will appear here
id: Riwayat terapi Anda akan muncul di sini
zh: 您的治疗历史将显示在这里

# labEmptyTitle
source: No Laboratory Data
id: Belum Ada Data Laboratorium
zh: 暂无化验数据

# labEmptySubtitle
source: Laboratory data will appear here after you add or load laboratory data
id: Data laboratorium akan muncul di sini setelah Anda menambahkan atau memuat data laboratorium
zh: 添加或加载化验数据后，数据将显示在这里

# filterClear
source: Clear
id: Bersihkan
zh: 清除

# filterCompany
source: Company
id: Perusahaan
zh: 公司

# filterProduct
source: Product
id: Produk
zh: 产品

# filterDateRange
source: Date Range
id: Rentang Tanggal
zh: 日期范围

source: Select Company
id: Pilih Perusahaan
zh: 选择公司

source: Select Product
id: Pilih Produk
zh: 选择产品

# dateFrom
source: From Date
id: Dari Tanggal
zh: 起始日期

# dateTo
source: To Date
id: Sampai Tanggal
zh: 结束日期

source: Apply Filter
id: Terapkan Filter
zh: 应用筛选

source: Retry
id: Coba Lagi
zh: 重试

source: No transactions found
id: Tidak ada transaksi ditemukan
zh: 未找到交易

source: No data available
id: Tidak ada data tersedia
zh: 暂无数据

# transactionStatusPending
source: Pending
id: Menunggu
zh: 待处理

# transactionStatusCancelled
source: Cancelled
id: Dibatalkan
zh: 已取消

# transactionDetailPaymentStatus
source: Payment Status
id: Status Pembayaran
zh: 支付状态

# therapyLoadingError
source: Failed to load therapy history
id: Gagal memuat riwayat terapi
zh: 加载治疗历史失败

# genericError
source: An error occurred. Please try again later.
id: Terjadi kesalahan. Silakan coba lagi nanti.
zh: 发生错误，请稍后重试

# languageChangeSuccess
source: Language changed to {language}
id: Bahasa diubah ke {language}
zh: 语言已更改为{language}

# branchLocationTitle
source: Rahoclub Branches
id: Cabang Rahoclub
zh: Rahoclub分店

# branchLocationRetry
source: Retry
id: Coba Lagi
zh: 重试

# branchLocationLoading
source: Loading branch data...
id: Memuat data cabang...
zh: 正在加载分店数据...

# branchLocationEmpty
source: No branch data
id: Belum ada data cabang
zh: 暂无分店数据

# branchLocationEmptyHint
source: Please try again later
id: Silakan coba lagi nanti
zh: 请稍后重试

# branchLocationReload
source: Try reload
id: Coba muat ulang
zh: 尝试重新加载

# diagnosisReload
source: Try reload
id: Coba muat ulang
zh: 尝试重新加载

# diagnosisEmpty
source: No diagnosis data
id: Belum ada data diagnosa
zh: 暂无诊断数据

# diagnosisReloadButton
source: Reload
id: Muat Ulang
zh: 重新加载

# genderMale
source: Male
id: Pria
zh: 男

# genderFemale
source: Female
id: Wanita
zh: 女

# genderSelectLabel
source: Select Gender
id: Pilih Gender
zh: 选择性别

# genderSelectTitle
source: Select Gender
id: Pilih Gender
zh: 选择性别

# personalDataCancelButton
source: Cancel
id: Batalkan
zh: 取消

# personalDataSaveButton
source: Save
id: Simpan
zh: 保存

# referenceNoData
source: No data available
id: Tidak ada data tersedia
zh: 暂无数据

# companyLoadError
source: Failed to load branch data
id: Gagal memuat data cabang
zh: 加载分店数据失败

# languageLoadError
source: Failed to load language: {error}
id: Gagal memuat bahasa: {error}
zh: 加载语言失败：{error}

# languageUnsupported
source: Language not supported
id: Bahasa tidak didukung
zh: 不支持该语言

# languageChangeError
source: Failed to change language: {error}
id: Gagal mengubah bahasa: {error}
zh: 更改语言失败：{error}

# languageResetError
source: Failed to reset language: {error}
id: Gagal mengatur ulang bahasa: {error}
zh: 重置语言失败：{error}

# profileLoadError
source: Failed to load profile
id: Gagal memuat profil
zh: 加载个人资料失败

# diagnosisLoadError
source: Failed to load diagnosis
id: Gagal memuat diagnosis
zh: 加载诊断失败

# profileUpdateSuccess
source: Profile updated successfully
id: Profil berhasil diperbarui
zh: 个人资料更新成功

# profileUpdateError
source: Failed to update profile
id: Gagal memperbarui profil
zh: 更新个人资料失败

# needleDataEmpty
source: No data available
id: Tidak ada data tersedia
zh: 暂无数据

# errorStateTitle
source: An Error Occurred
id: Terjadi Kesalahan
zh: 发生错误

# errorStateRetry
source: Retry
id: Coba Lagi
zh: 重试

# labLoadError
source: Failed to load data
id: Gagal memuat data
zh: 加载数据失败

# labLoadMoreError
source: Failed to load additional data
id: Gagal memuat data tambahan
zh: 加载更多数据失败

# therapyLoadError
source: Failed to load data
id: Gagal memuat data
zh: 加载数据失败

# therapyLoadMoreError
source: Failed to load additional data
id: Gagal memuat data tambahan
zh: 加载更多数据失败

# transactionLoadError
source: Failed to load transactions
id: Gagal memuat transaksi
zh: 加载交易失败

# transactionDetailNotFound
source: Transaction details not found
id: Detail transaksi tidak ditemukan
zh: 未找到交易详情

source: Transaction ID required
id: ID transaksi diperlukan
zh: 需要交易ID

# transactionTypeInvalid
source: Invalid transaction type. Must be 'payment' or 'faktur'
id: Tipe transaksi tidak valid. Harus 'payment' atau 'faktur'
zh: 无效交易类型，必须是'payment'或'faktur'

source: Transaction not found
id: Transaksi tidak ditemukan
zh: 未找到交易

# transactionDetailLoadError
source: Failed to load transaction details
id: Gagal memuat detail transaksi
zh: 加载交易详情失败

# transactionFilterLabel
source: Select Transaction
id: Pilih Transaksi
zh: 选择交易

# transactionFilterAll
source: All Transactions
id: Semua Transaksi
zh: 所有交易

# transactionFilterPayment
source: Purchase
id: Pembelian
zh: 购买

# transactionFilterService
source: Service
id: Pelayanan
zh: 服务

# transactionPaymentDefault
source: Payment
id: Pembayaran
zh: 支付

# transactionServiceDefault
source: Therapy
id: Terapi
zh: 治疗

# transactionNoPaymentFound
source: No purchase transactions found
id: Tidak ada transaksi pembelian ditemukan
zh: 未找到购买交易

# transactionNoServiceFound
source: No service transactions found
id: Tidak ada transaksi pelayanan ditemukan
zh: 未找到服务交易

# authSessionRestored
source: Session restored successfully
id: Sesi berhasil dipulihkan
zh: 会话恢复成功

# authProfileUpdated
source: Profile updated successfully
id: Profil berhasil diperbarui
zh: 个人资料更新成功

# authRefreshError
source: Failed to update profile: {error}
id: Gagal memperbarui profil: {error}
zh: 更新个人资料失败：{error}

# authLogoutError
source: Failed to logout: {error}
id: Gagal keluar: {error}
zh: 登出失败：{error}

# error_server
source: Server error occurred
id: Terjadi kesalahan server
zh: 服务器错误

# require_id
source: Registration ID is required
id: ID Registrasi harus diisi
zh: 注册ID为必填项

# id_not_found
source: Registration ID not found
id: ID Registrasi tidak ditemukan
zh: 未找到注册ID

# otp_failed
source: Failed to send OTP
id: Gagal mengirim OTP
zh: 发送验证码失败

# otp_max_attempt
source: Maximum OTP attempts reached
id: Maksimal percobaan OTP telah tercapai
zh: 已达到验证码最大尝试次数

# otp_invalid
source: Invalid OTP code
id: Kode OTP tidak valid
zh: 验证码无效

# otp_expired
source: OTP code expired
id: Kode OTP sudah kadaluarsa
zh: 验证码已过期

# otp_max_daily
source: Daily OTP request limit reached
id: Maksimal permintaan OTP harian telah tercapai
zh: 已达到每日验证码请求限制

# otp_sended
source: OTP sent to your WhatsApp
id: OTP telah dikirim ke WhatsApp Anda
zh: 验证码已发送到您的WhatsApp

# otp_verified
source: OTP verified successfully
id: OTP berhasil diverifikasi
zh: 验证码验证成功

# already_verified
source: Number already verified
id: Nomor sudah terverifikasi
zh: 号码已验证

# unknown_error
source: Unknown error occurred
id: Terjadi kesalahan yang tidak diketahui
zh: 未知错误

# companies_empty
source: No company branch data
id: Tidak ada data cabang perusahaan
zh: 暂无公司分店数据

# companies_fetch_success
source: Company branch data retrieved successfully
id: Data cabang perusahaan berhasil diambil
zh: 公司分店数据获取成功

# dashboard_fetch_success
source: Dashboard data loaded successfully
id: Data dashboard berhasil dimuat
zh: 仪表板数据加载成功

# profile_fetch_success
source: Profile data retrieved successfully
id: Data profil berhasil diambil
zh: 个人资料数据获取成功

# diagnosis_fetch_success
source: Diagnosis data retrieved successfully
id: Data diagnosis berhasil diambil
zh: 诊断数据获取成功

# references_fetch_success
source: Reference data retrieved successfully
id: Data referensi berhasil diambil
zh: 参考数据获取成功

# profile_update_success
source: Profile updated successfully
id: Profil berhasil diperbarui
zh: 个人资料更新成功

# invalid_field_type
source: Invalid field format
id: Format field tidak valid
zh: 字段格式无效

# invalid_sex_value
source: Invalid gender field value
id: Nilai field jenis kelamin tidak valid
zh: 性别字段值无效

# invalid_date_format
source: Invalid date format (use DD-MM-YYYY)
id: Format tanggal tidak valid (gunakan DD-MM-YYYY)
zh: 日期格式无效（请使用DD-MM-YYYY）

# invalid_image_format
source: Invalid or corrupted image format
id: Format gambar tidak valid atau rusak
zh: 图片格式无效或已损坏

source: Patient not found
id: Pasien tidak ditemukan
zh: 未找到患者

# transaction_fetch_success
source: Transaction data retrieved successfully
id: Data transaksi berhasil diambil
zh: 交易数据获取成功

# transaction_detail_fetch_success
source: Transaction details retrieved successfully
id: Detail transaksi berhasil diambil
zh: 交易详情获取成功

source: Invalid transaction type
id: Jenis transaksi tidak valid
zh: 无效交易类型

source: Transaction not found
id: Transaksi tidak ditemukan
zh: 未找到交易

# transaction_id_required
source: Transaction ID is required
id: ID transaksi harus diisi
zh: 交易ID为必填项

# therapy_history_success
source: Therapy history data retrieved successfully
id: Data riwayat terapi berhasil diambil
zh: 治疗历史数据获取成功

# therapy_history_failed
source: Failed to retrieve therapy history data
id: Gagal mengambil data riwayat terapi
zh: 获取治疗历史数据失败

# lab_data_fetched
source: Laboratory data retrieved successfully
id: Data laboratorium berhasil diambil
zh: 化验数据获取成功

# error_system
source: System error occurred
id: Terjadi kesalahan sistem
zh: 系统错误

# therapy_not_found
source: Therapy data not found or access denied
id: Data terapi tidak ditemukan atau akses ditolak
zh: 未找到治疗数据或访问被拒绝
